app/views/points/_point.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT COUNT(*) FROM "points" WHERE (user_id IN (SELECT followed_id FROM relationships WHERE follower_id = 1) OR user_id = 1)
SELECT  "points".* FROM "points" WHERE (user_id IN (SELECT followed_id FROM relationships WHERE follower_id = 1) OR user_id = 1)  ORDER BY created_at DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "points" WHERE "points"."user_id" = ?  [["user_id", 1]]
---
	<%= link_to gravatar_for(point.user, size: 50), point.user %>
	<span class="user"><%= link_to "#{point.user.first_name} #{point.user.last_name}", point.user %></span>
	<% unless point.counterpoint_to_id.nil? %>
		countered
		<span class="counterpoint-to"><%= link_to "#{point.countered_user.first_name} #{point.countered_user.last_name}'s	point", point_path(point.counterpoint_to_id) %></span>

SELECT  "points".* FROM "points" WHERE "points"."id" = ?  ORDER BY created_at DESC LIMIT 1  [["id", 1]]
SELECT  1 AS one FROM "points" WHERE "points"."user_id" = ? LIMIT 1  [["user_id", 1]]
---
			<%= link_to "delete", point, method: :delete, data: { confirm: "Are you sure?" }, title: point.content %>
		<% elsif request.env['PATH_INFO'] != new_point_path && Point.where(user_id: current_user, counterpoint_to_id: point.id).empty? %>