app/views/shared/_user_info.html.erb

SELECT COUNT(*) FROM "points" WHERE "points"."user_id" = ?  [["user_id", 1]]
---
<span><%= link_to "view profile", current_user %></span>
<span><%= pluralize(current_user.points.count, "point") %></span>