app/controllers/password_resets_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", ""]]
---
	def create
		@user = User.find_by(email: params[:password_reset][:email].downcase)

UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$04$nbVnSV51l8SUU.lrvBnF8OXNYKmy0RRU8/1WZLzvVSVyiBQwSGSve"], ["updated_at", "2015-04-27 17:02:52.962393"], ["id", 625417172]]
---
	def update
		if both_passwords_blank?
			flash.now[:danger] = "Password/confirmation can't be blank"
			render 'edit'
		elsif @user.update_attributes(user_params)