app/controllers/points_controller.rb

SELECT COUNT(*) FROM "points" WHERE "points"."user_id" = ?  [["user_id", 1]]
---
	def create
		@point = current_user.points.build(point_params)
		@point.counterpoint_to_id = params[:counterpoint_to_id] unless params[:counterpoint_to_id].nil?

SELECT  "points".* FROM "points" WHERE "points"."id" = ?  ORDER BY created_at DESC LIMIT 1  [["id", 1]]
---
	def show
		@point = Point.find(params[:id])