app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "a.leon.wolff@gmail.com"]]
---
	def create
<<<<<<< HEAD
		@user = User.find_by(email: params[:session][:email].downcase)