app/controllers/static_pages_controller.rb

SELECT  "points".* FROM "points" WHERE (user_id IN (SELECT followed_id FROM relationships WHERE follower_id = 1) OR user_id = 1)  ORDER BY created_at DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "points" WHERE (user_id IN (SELECT followed_id FROM relationships WHERE follower_id = 1) OR user_id = 1)
---
  def home
		if logged_in?
			@point = current_user.points.build
			@feed_items = current_user.feed.paginate(page: params[:page])