app/controllers/users_controller.rb

UPDATE "users" SET "password_digest" = ?, "admin" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$04$4nko9.Rf/ANfKgUVr31CfOEuFhn2.GeQwUDONsCKtDo79bLKKXm1y"], ["admin", "t"], ["updated_at", "2015-04-24 16:18:22.182061"], ["id", 950961012]]
---
	def update
		if @user.update_attributes(user_params)

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 950961012]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 625417172]]
---
	def destroy
		User.find(params[:id]).destroy