app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "points".* FROM "points" WHERE "points"."user_id" = ?  ORDER BY created_at DESC LIMIT 30 OFFSET 0  [["user_id", 1]]
SELECT COUNT(*) FROM "points" WHERE "points"."user_id" = ?  [["user_id", 1]]
---
	def show
		@user = User.find(params[:id])
		@points = @user.points.paginate(page: params[:page])

INSERT INTO "users" ("first_name", "last_name", "email", "password_digest", "created_at", "updated_at", "activation_digest") VALUES (?, ?, ?, ?, ?, ?, ?)
---
	def create
		@user = User.new(user_params)
		if @user.save